src/DataProcessors/Scan_ВебСервисы/Scan_ВебСервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_ВебСервисы</name>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_Обмен1БДНастройкиПроверкиМетодов/Scan_Обмен1БДНастройкиПроверкиМетодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_Обмен1БДНастройкиПроверкиМетодов</name>
  <resources>
    <name>Проверять</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЗапроса</name>
    <type>
      <types>CatalogRef.Scan_ВидыЗапроса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_ВидыЗапроса/Scan_ВидыЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВидыЗапроса</name>
  <comment>Виды запросов в 1БД</comment>
  <predefined>
    <items>
      <name>AddUpdateUser</name>
      <description>AddUpdateUser</description>
    </items>
    <items>
      <name>CheckUserTokenIsOnline</name>
      <description>CheckUserTokenIsOnline</description>
    </items>
    <items>
      <name>CloseExchangeSession</name>
      <description>CloseExchangeSession</description>
    </items>
    <items>
      <name>CreateProduct</name>
      <description>CreateProduct</description>
    </items>
    <items>
      <name>CreateSOP</name>
      <description>CreateSOP</description>
    </items>
    <items>
      <name>GetAdditionalProperty</name>
      <description>GetAdditionalProperty</description>
    </items>
    <items>
      <name>GetChassis</name>
      <description>GetChassis</description>
    </items>
    <items>
      <name>GetCompany</name>
      <description>GetCompany</description>
    </items>
    <items>
      <name>GetContragents</name>
      <description>GetContragents</description>
    </items>
    <items>
      <name>GetDealers</name>
      <description>GetDealers</description>
    </items>
    <items>
      <name>GetEngines</name>
      <description>GetEngines</description>
    </items>
    <items>
      <name>GetEPTS</name>
      <description>GetEPTS</description>
    </items>
    <items>
      <name>GetEPTSstatement</name>
      <description>GetEPTSstatement</description>
    </items>
    <items>
      <name>GetListContragent</name>
      <description>GetListContragent</description>
    </items>
    <items>
      <name>GetListDogovorov</name>
      <description>GetListDogovorov</description>
    </items>
    <items>
      <name>GetListOfCategories</name>
      <description>GetListOfCategories</description>
    </items>
    <items>
      <name>GetListOfChassis</name>
      <description>GetListOfChassis</description>
    </items>
    <items>
      <name>GetListOfCommercialOffers</name>
      <description>GetListOfCommercialOffers</description>
    </items>
    <items>
      <name>GetListOfCompany</name>
      <description>GetListOfCompany</description>
    </items>
    <items>
      <name>GetListOfCompanyGroup</name>
      <description>GetListOfCompanyGroup</description>
    </items>
    <items>
      <name>GetListOfCompanyType</name>
      <description>GetListOfCompanyType</description>
    </items>
    <items>
      <name>GetListOfContragents</name>
      <description>GetListOfContragents</description>
    </items>
    <items>
      <name>GetListOfCooperationType</name>
      <description>GetListOfCooperationType</description>
    </items>
    <items>
      <name>GetListOfCostCenters</name>
      <description>GetListOfCostCenters</description>
    </items>
    <items>
      <name>GetListOfCountries</name>
      <description>GetListOfCountries</description>
    </items>
    <items>
      <name>GetListOfDealers</name>
      <description>GetListOfDealers</description>
    </items>
    <items>
      <name>GetListOfDealerType</name>
      <description>GetListOfDealerType</description>
    </items>
    <items>
      <name>GetListOfDeliveries</name>
      <description>GetListOfDeliveries</description>
    </items>
    <items>
      <name>GetListOfEngines</name>
      <description>GetListOfEngines</description>
    </items>
    <items>
      <name>GetListOfManufacturers</name>
      <description>GetListOfManufacturers</description>
    </items>
    <items>
      <name>GetListOfOptions</name>
      <description>GetListOfOptions</description>
    </items>
    <items>
      <name>GetListOfOrderToDelivery</name>
      <description>GetListOfOrderToDelivery</description>
    </items>
    <items>
      <name>GetListOfProduct</name>
      <description>GetListOfProduct</description>
    </items>
    <items>
      <name>GetListOfProductGroup</name>
      <description>GetListOfProductGroup</description>
    </items>
    <items>
      <name>GetListOfProductMark</name>
      <description>GetListOfProductMark</description>
    </items>
    <items>
      <name>GetListOfProductModel</name>
      <description>GetListOfProductModel</description>
    </items>
    <items>
      <name>GetListOfProductSubType</name>
      <description>GetListOfProductSubType</description>
    </items>
    <items>
      <name>GetListOfProductType</name>
      <description>GetListOfProductType</description>
    </items>
    <items>
      <name>GetListOfProductTypeSPORT</name>
      <description>GetListOfProductTypeSPORT</description>
    </items>
    <items>
      <name>GetListOfQuotation</name>
      <description>GetListOfQuotation</description>
    </items>
    <items>
      <name>GetListOfRegions</name>
      <description>GetListOfRegions</description>
    </items>
    <items>
      <name>GetListOfSOP</name>
      <description>GetListOfSOP</description>
    </items>
    <items>
      <name>GetListOfSpecifications</name>
      <description>GetListOfSpecifications</description>
    </items>
    <items>
      <name>GetListOfSpecificationType</name>
      <description>GetListOfSpecificationType</description>
    </items>
    <items>
      <name>GetListOfSpecificationView</name>
      <description>GetListOfSpecificationView</description>
    </items>
    <items>
      <name>GetListOfSpecificationViewType</name>
      <description>GetListOfSpecificationViewType</description>
    </items>
    <items>
      <name>GetListOfStatuses</name>
      <description>GetListOfStatuses</description>
    </items>
    <items>
      <name>GetManufacturers</name>
      <description>GetManufacturers</description>
    </items>
    <items>
      <name>GetOrderStatus</name>
      <description>GetOrderStatus</description>
    </items>
    <items>
      <name>GetOrderToDelivery</name>
      <description>GetOrderToDelivery</description>
    </items>
    <items>
      <name>GetProduct</name>
      <description>GetProduct</description>
    </items>
    <items>
      <name>GetProductCommercialOffers</name>
      <description>GetProductCommercialOffers</description>
    </items>
    <items>
      <name>GetProductGroup</name>
      <description>GetProductGroup</description>
    </items>
    <items>
      <name>GetProductMark</name>
      <description>GetProductMark</description>
    </items>
    <items>
      <name>GetProductModel</name>
      <description>GetProductModel</description>
    </items>
    <items>
      <name>GetProductSubType</name>
      <description>GetProductSubType</description>
    </items>
    <items>
      <name>GetProductType</name>
      <description>GetProductType</description>
    </items>
    <items>
      <name>GetQuotation</name>
      <description>GetQuotation</description>
    </items>
    <items>
      <name>GetSOP</name>
      <description>GetSOP</description>
    </items>
    <items>
      <name>GetSpecification</name>
      <description>GetSpecification</description>
    </items>
    <items>
      <name>GetSpecificationVersion</name>
      <description>GetSpecificationVersion</description>
    </items>
    <items>
      <name>GetSpecificationView</name>
      <description>GetSpecificationView</description>
    </items>
    <items>
      <name>GetTaskOfExecution</name>
      <description>GetTaskOfExecution</description>
    </items>
    <items>
      <name>GetUpdatesList</name>
      <description>GetUpdatesList</description>
    </items>
    <items>
      <name>GetUser</name>
      <description>GetUser</description>
    </items>
    <items>
      <name>OpenExchangeSession</name>
      <description>OpenExchangeSession</description>
    </items>
    <items>
      <name>SendProductActivityEvent</name>
      <description>SendProductActivityEvent</description>
    </items>
    <items>
      <name>SetAdditionalProperty</name>
      <description>SetAdditionalProperty</description>
    </items>
    <items>
      <name>SetChassis</name>
      <description>SetChassis</description>
    </items>
    <items>
      <name>SetLocation</name>
      <description>SetLocation</description>
    </items>
    <items>
      <name>SetOrderToDelivery</name>
      <description>SetOrderToDelivery</description>
    </items>
    <items>
      <name>SetProduct</name>
      <description>SetProduct</description>
    </items>
    <items>
      <name>SetProductPlace</name>
      <description>SetProductPlace</description>
    </items>
    <items>
      <name>SetPurchaseOrder</name>
      <description>SetPurchaseOrder</description>
    </items>
    <items>
      <name>SetPurchaseOrderApproval</name>
      <description>SetPurchaseOrderApproval</description>
    </items>
    <items>
      <name>SetSOP</name>
      <description>SetSOP</description>
    </items>
    <items>
      <name>SetTaskOfExecution</name>
      <description>SetTaskOfExecution</description>
    </items>
    <items>
      <name>StoreInfo</name>
      <description>StoreInfo</description>
    </items>
  </predefined>
  <attributes>
    <name>Запрос1СДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПортала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОчищатьИсториюЗапроса</name>
    <comment>#18705</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ДоговорыВзаиморасчетов/Scan_ДоговорыВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ДоговорыВзаиморасчетов</name>
  <basedOn>Catalog.Scan_ДоговорыВзаиморасчетов</basedOn>
  <owners>Catalog.Scan_Контрагенты</owners>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.Scan_ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасторжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОIDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОснование</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДОДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОДатаОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОДоговорПолученИз1СДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДОНаименованиеДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОУсловияОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОУсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расторгнут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СОП_ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СОП_СтатусОплаты</name>
    <type>
      <types>EnumRef.Scan_СтатусыОплатПоСОП</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокБесплатногоХраненияПродукта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МестаХранения</name>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.Scan_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Scan_ВебСервисы/Forms/Форма/Module.bsl
// Rarus tenkam 28.06.2022 mantis 18726 АПК + (Стандартные области)
#Область ОбработчикиСобытийФормы

// rarus tenkam 19.03.2019 mantis 13629 +++

////// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДиалогомНаСервере();
	
	ТекДатаНачала = НачалоДня(ТекущаяДата());
	ТекДатаОкончания = КонецДня(ТекущаяДата());
	ПериодОтборОтправка.ДатаНачала = ТекДатаНачала;
	ПериодОтборОтправка.ДатаОкончания = ТекДатаОкончания;
	ПериодОтборПолучение.ДатаНачала = ТекДатаНачала;
	ПериодОтборПолучение.ДатаОкончания = ТекДатаОкончания;
	
	УстановитьОтборСписка(ТекДатаНачала, ТекДатаОкончания);
	
	// rarus tenkam 08.04.2019 mantis 14308 +++
	ЗаполнитьНастройкиПроверкиМетодов();
	// rarus tenkam 08.04.2019 mantis 14308 ---
	Scan_СборСтатистики.Scan_ПриОткрытииОбработки(РеквизитФормыВЗначение("Объект").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ

&НаКлиенте
Процедура ВидЗапросаПриИзменении(Элемент)
	ИмяМетода = ПолучитьИмяПеречисления(ВидЗапроса);
	//rarus agar 13.03.2021 17373 ++
	//rarus agar 15.10.2020 15696 ++
	//Запрос1СДО = ВидЗапроса1СДО(ВидЗапроса);
	СтруктураВидЗапроса = ВидЗапроса1СДОПортала(ВидЗапроса);
	Запрос1СДО    = СтруктураВидЗапроса.Запрос1СДО;
	ЗапросПортала = СтруктураВидЗапроса.ЗапросПортала;
	//rarus agar 15.10.2020 15696 --
	//rarus agar 13.03.2021 17373 --
	ОбновитьТаблицуДополнительныхПолей();	
	УправлениеДиалогомНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМетодПриИзменении(Элемент)
	УправлениеДиалогомНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломИзменения(Элемент, Отказ)
	ТипПоля = ПолучитьТипПоля(Элементы.ДополнительныеПоля.ТекущиеДанные.Поле);
	
	Элемент.ПодчиненныеЭлементы.ДополнительныеПоляЗначение.ВыбиратьТип = Ложь;
	Элемент.ПодчиненныеЭлементы.ДополнительныеПоляЗначение.ОграничениеТипа = ТипПоля;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтборОтправкаПриИзменении(Элемент)
	ДатаНачала = ?(ЗначениеЗаполнено(ПериодОтборОтправка.ДатаНачала), НачалоДня(ПериодОтборОтправка.ДатаНачала), Дата('00010101'));
	ДатаОкончания = ?(ЗначениеЗаполнено(ПериодОтборОтправка.ДатаОкончания), КонецДня(ПериодОтборОтправка.ДатаОкончания), Дата('39991231'));
	УстановитьОтборСписка(ДатаНачала, ДатаОкончания, Ложь, Истина)
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтборПриИзменении(Элемент)
	ДатаНачала = ?(ЗначениеЗаполнено(ПериодОтборПолучение.ДатаНачала), НачалоДня(ПериодОтборПолучение.ДатаНачала), Дата('00010101'));
	ДатаОкончания = ?(ЗначениеЗаполнено(ПериодОтборПолучение.ДатаОкончания), КонецДня(ПериодОтборПолучение.ДатаОкончания), Дата('39991231'));
	УстановитьОтборСписка(ДатаНачала, ДатаОкончания, Истина, Ложь)
КонецПроцедуры

// rarus tenkam 08.04.2019 mantis 14308 +++
&НаКлиенте
Процедура ПроверятьПриИзменении(Элемент)
	ТекДанные = Элементы.НастройкиПроверкиМетодов1БД.ТекущиеДанные;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВидЗапроса", ТекДанные.ВидЗапроса);
	СтруктураДанных.Вставить("Проверять", ТекДанные.Проверять);

	ОбновитьНастройкуПроверкиВРегистре(СтруктураДанных);
КонецПроцедуры
// rarus tenkam 08.04.2019 mantis 14308 ---

#КонецОбласти

#Область ОбработчикиКомандФормы

////// КОМАНДЫ

&НаКлиенте
Процедура ОбновитьНастройкиПроверки(Команда) // rarus tenkam 08.04.2019 mantis 14308 +
	ЗаполнитьНастройкиПроверкиМетодов();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗапрос(Команда)
	Если ЗначениеЗаполнено(ИмяМетода) Тогда
		СтруктураПараметров = Новый Структура;
		Для Каждого СтрокаДопПолей Из ДополнительныеПоля Цикл
			СтруктураПараметров.Вставить(СтрокаДопПолей.Поле, СтрокаДопПолей.Значение);
		КонецЦикла;
		Отказ = Ложь;
		
		//rarus agar 15.10.2020 15696 ++
		Если Запрос1СДО Тогда
			ТекДокЗапрос = СформироватьТекстЗапроса1СДО(ИмяМетода, СтруктураПараметров);
		//rarus agar 13.03.2021 17373 ++
		ИначеЕсли ЗапросПортала Тогда
			ТекДокЗапрос = СформироватьТекстЗапросаПортала(ИмяМетода, СтруктураПараметров);
		//rarus agar 13.03.2021 17373 --
		Иначе
			СообщениеОбмена = Scan_ВебСервисы.СформироватьСообщениеОбмена(ИмяМетода, СтруктураПараметров, Отказ, "Веб-сервис." + ИмяМетода);
			ТекДокЗапрос = СообщениеОбмена;
			
			// rarus tenkam 24.09.2020 mantis 16181 +++
			Если (ИмяМетода = "CreateSOP" ИЛИ ИмяМетода = "SetSOP") И СтруктураПараметров.Свойство("КодДоговора") И ЗначениеЗаполнено(СтруктураПараметров.КодДоговора) Тогда
				ТекДокЗапрос = СформироватьТекстCreateSetSOP(СтруктураПараметров.КодДоговора, ИмяМетода);			
			ИначеЕсли ИмяМетода = "SetSOP" Тогда
				
			КонецЕсли;
			// rarus tenkam 24.09.2020 mantis 16181 ---
		КонецЕсли;
		//rarus agar 15.10.2020 15696 --
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтвет(Команда)
	Отказ = Ложь;

	Если ИспользоватьМетод Тогда
		Если ЗначениеЗаполнено(ИмяМетода) Тогда
			СтруктураПараметров = Новый Структура;
			Для Каждого СтрокаДопПолей Из ДополнительныеПоля Цикл
				СтруктураПараметров.Вставить(СтрокаДопПолей.Поле, СтрокаДопПолей.Значение);
			КонецЦикла;
			
			//rarus agar 15.10.2020 15696 ++
			Если Запрос1СДО Тогда
				ТекДокОтвет = ВызватьМетод1СДО(ИмяМетода, СтруктураПараметров);
			//rarus agar 13.03.2021 17373 ++
			ИначеЕсли ЗапросПортала Тогда
				ТекДокОтвет = ВызватьМетодПортала(ИмяМетода, СтруктураПараметров);
			//rarus agar 13.03.2021 17373 --
			Иначе
				ТекДокОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, "Веб-сервис." + ИмяМетода, ТекДокЗапрос); 
			КонецЕсли;
			//rarus agar 15.10.2020 15696 --
		КонецЕсли;
	Иначе
		ТекДокОтвет = Scan_ВебСервисы.ВызватьМетод("Неопределено", СтруктураПараметров, Отказ, "Веб-сервис." + ИмяМетода, ТекДокЗапрос);		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РазобратьОтветТестНаСервере()
	Если СокрЛП(ТекДокОтвет) = "" Тогда
		Возврат;
	КонецЕсли;
	Отказ = Ложь;	
	СообщениеОбОшибке = "";
	Если ИмяМетода = "GetListOfProductMark" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникМаркиПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetProductMark" Тогда 
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникМаркиПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetListOfProductGroup" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникГруппыПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetProductGroup" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникГруппыПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfProductType" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникВидыПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetProductType" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникВидыПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetListOfProductSubType" Тогда
		// rarus tenkam 19.09.2019 mantis 14442 +++
		//Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
		// rarus tenkam 19.09.2019 mantis 14442 ---	
	ИначеЕсли ИмяМетода = "GetProductSubType" Тогда
		// rarus tenkam 19.09.2019 mantis 14442 +++
		//Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
		// rarus tenkam 19.09.2019 mantis 14442 ---	
	//rarus bonmak 14.04.2020 15891 ++
	//ИначеЕсли ИмяМетода = "GetListOfManufacturers" Тогда
	//	Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникПроизводителиМарок(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	//ИначеЕсли ИмяМетода = "GetManufacturers" Тогда
	//	Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникПроизводителиМарок(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	//rarus bonmak 14.04.2020 15891 --
	ИначеЕсли ИмяМетода = "GetListOfProductModel" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникМоделиПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetProductModel" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникМоделиПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfChassis" Тогда
		//rarus bonmak 09.08.2021 16834 Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникИзделия(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetChassis" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтвета_GetChassis(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfEngines" Тогда
		//rarus bonmak 09.08.2021 16834 Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникИзделия(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetEngines" Тогда
		//rarus bonmak 09.08.2021 16834 Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникИзделия(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	//rarus bonmak 15.04.2020 14456 ++	
	//ИначеЕсли ИмяМетода = "GetListOfDealers" Тогда
	//	Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникДилеры(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	//ИначеЕсли ИмяМетода = "GetDealers" Тогда
	//	Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникДилеры(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetCompany" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаКомпании(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	//rarus bonmak 15.04.2020 14456 --
	ИначеЕсли ИмяМетода = "GetListOfContragents" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникКонтрагенты(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetContragents" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникКонтрагенты(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetListOfProduct" Тогда
		//rarus bonmak 09.08.2021 16834 Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникПродукты(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetProduct" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтвета_GetProduct(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfCommercialOffers" Тогда
	ИначеЕсли ИмяМетода = "GetProductCommercialOffers" Тогда
	ИначеЕсли ИмяМетода = "GetListOfOrderToDelivery" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникЗаказыНаЗавод(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetOrderToDelivery" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникЗаказыНаЗавод(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	// rarus tenkam 09.09.2019 mantis 14841 +++	
	//ИначеЕсли ИмяМетода = "GetListOfSpecifications" Тогда
	//	Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникСпецификацииПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetSpecification" Тогда //rarus bonmak 08.10.2019 14177 ++
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникВерсииСпецификацииПродуктов(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
		//rarus bonmak 08.10.2019 14177 --
		// rarus tenkam 09.09.2019 mantis 14841 ---	
	ИначеЕсли ИмяМетода = "GetListOfStatuses" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникЗаводскиеСтатусы(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfSOP" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникДоговорыВзаиморасчетовСОП(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetSOP" Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникДоговорыВзаиморасчетовСОП(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	ИначеЕсли ИмяМетода = "GetListOfCompanyType" Тогда //rarus BProg_Dekin 18.02.2020 mantis 0014456 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникФормыКомпаний(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfCompanyGroup" Тогда //rarus BProg_Dekin 18.02.2020 mantis 0014456 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникГруппыКомпаний(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfDealerType" Тогда //rarus BProg_Dekin 18.02.2020 mantis 0014456 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыДилеров(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfCooperationType" Тогда //rarus BProg_Dekin 18.02.2020 mantis 0014456 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникВидыВзаимодействий(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfSpecificationViewType" Тогда //rarus BProg_Dekin 16.03.2020 mantis 0014177 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникВидыПредставленийСпецификаций(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetListOfSpecificationView" Тогда //rarus BProg_Dekin 16.03.2020 mantis 0014177 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникПредставленияСпецификаций(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
	ИначеЕсли ИмяМетода = "GetSpecificationView" Тогда //rarus BProg_Dekin 16.03.2020 mantis 0014177 +-
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникИерархияОпцийПредставленийСпецификации(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);
		//rarus ozhnik 15888 10.06.2020 + 
	ИначеЕсли ИмяМетода = "GetListOfRegions" Тогда //rarus bonmak 07.01.2021 16625 ++
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникРегионы(ТекДокОтвет, Отказ, СообщениеОбОшибке, "Веб-сервис." + ИмяМетода, ИмяМетода);	
	//rarus bonmak 07.01.2021 16625 --	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазобратьОтветТест(Команда)
	РазобратьОтветТестНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрос(Команда)
	Если Не ЗначениеЗаполнено(ВидЗапроса) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Вид запроса не заполнен'; en = 'Empty field'");
		Сообщение.Поле = "ВидЗапроса";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Scan_ВебСервисыПроверкаМетодов.ПроверитьМетод(ВидЗапроса);
	Элементы.ПроверкаМетодовОбменаС1БД.Обновить();
КонецПроцедуры

//// Обновление списков

&НаКлиенте
Процедура ОбновитьПолучения(Команда)
	Элементы.НезагруженныеОбъекты.Обновить();
	Элементы.РегистрацияОбмена1БД.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	Элементы.ОтправленныеСобытия.Обновить();
	Элементы.НеотправленныеСобытия.Обновить();
	//Элементы.ДанныеДляОтправки.Обновить(); //rarus bonmak 09.08.2021 16834 
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


///// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	//Если ИспользоватьМетод Тогда
	//Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(ИспользоватьМетод, Элементы.ГруппаПоля, Элементы.ГруппаЗапрос);
	Элементы.ВидЗапроса.Доступность = ИспользоватьМетод;
	Элементы.ГруппаДопПоля.Видимость = ИспользоватьМетод;
	//Элементы.ТекДокЗапрос.ТолькоПросмотр = ИспользоватьМетод;
	//rarus agar 15.10.2020 15696 ++
	//Элементы.ПроверитьЗапрос.Доступность = ИспользоватьМетод;
	//Элементы.ПроверитьЗапрос.Доступность = ИспользоватьМетод И Не ВидЗапроса.Запрос1СДО;
	Элементы.ПроверитьЗапрос.Доступность = ИспользоватьМетод И Не ВидЗапроса.Запрос1СДО И Не ВидЗапроса.ЗапросПортала; //rarus agar 13.03.2021 17373 +- 
	//rarus agar 15.10.2020 15696 --
	Элементы.СформироватьЗапрос.Доступность = ИспользоватьМетод;
	//rarus agar 15.10.2020 15696 ++
	//Элементы.РазобратьОтветТест.Доступность = ИспользоватьМетод;
	//Элементы.РазобратьОтветТест.Доступность = ИспользоватьМетод И Не ВидЗапроса.Запрос1СДО;
	Элементы.РазобратьОтветТест.Доступность = ИспользоватьМетод И Не ВидЗапроса.Запрос1СДО И Не ВидЗапроса.ЗапросПортала; //rarus agar 13.03.2021 17373 +- 
	//rarus agar 15.10.2020 15696 --
	
	ТекДокЗапрос = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуДополнительныхПолей() 
	ДополнительныеПоля.Очистить();
	ЭтоСписок = (СтрНайти(ИмяМетода, "ListOf") <> 0);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров = ПолучитьСтруктуру(ИмяМетода, ЭтоСписок);
	
	Для Каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		НоваяСтрока = ДополнительныеПоля.Добавить();
		НоваяСтрока.Поле = ЭлементСтруктуры.Ключ;
	
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипПоля(Поле)
	
	Если Поле = "DeletionMark" Тогда
		ТипПоля = Новый ОписаниеТипов("Булево");
	ИначеЕсли Поле = "ДатаИзменения" ИЛИ Поле = "ДатаНачала" ИЛИ Поле = "ДатаОкончания" ИЛИ 
		Поле = "ДатаСобытия" ИЛИ Поле = "ДатаОкончанияОСАГО" ИЛИ Поле = "СрокУстраненияНедостатковДата" ИЛИ
		Поле = "DD" ИЛИ Поле = "DD2" ИЛИ Поле = "DDS" ИЛИ Поле = "Период" Тогда	// rarus tenkam 28.04.2021 mantis 17659 +
		
		ТипПоля = Новый ОписаниеТипов("Дата");
	ИначеЕсли  Поле = "СрокУстранениеНедостатковДни" Тогда
		ТипПоля = Новый ОписаниеТипов("Число");	
	Иначе
		ТипПоля = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	Возврат ТипПоля;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуру(ИмяМетодаWS, ЭтоСписок)	
	СтруктураНовая = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетодаWS, ЭтоСписок);
	Возврат СтруктураНовая;
КонецФункции

&НаСервереБезКонтекста
//Получает текстовое наименование справочника
Функция ПолучитьИмяПеречисления(ВидЗапроса)
	Если ЗначениеЗаполнено(ВидЗапроса) Тогда
		//rarus bonmak 21.08.2020 16210 ++
		//ЗначениеПеречисления = ВидЗапроса;		
		//ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;		
		//ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);		
		//ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		ИмяЗначенияПеречисления = ВидЗапроса.ИмяПредопределенныхДанных;
		//rarus bonmak 21.08.2020 16210 --
	Иначе
		ИмяЗначенияПеречисления = "";
	КонецЕсли;
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции

//rarus agar 15.10.2020 15696 ++

&НаСервереБезКонтекста
//rarus agar 13.03.2021 17373 ++
//Функция ВидЗапроса1СДО(ВидЗапроса)
Функция ВидЗапроса1СДОПортала(ВидЗапроса)
//rarus agar 13.03.2021 17373 --
	
	СтруктураВидЗапроса = Новый Структура;
	СтруктураВидЗапроса.Вставить("Запрос1СДО",    ВидЗапроса.Запрос1СДО);
	СтруктураВидЗапроса.Вставить("ЗапросПортала", ВидЗапроса.ЗапросПортала);
	
	Возврат СтруктураВидЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТекстЗапроса1СДО(ИмяМетода, ПараметрыВызова)
	
	ТекстЗапроса = "";
	ОбъектXDTO   = Неопределено;
	
	Прокси = Scan_ВебСервисы.ПолучитьПрокси1СДО();
	
	Если ИмяМетода = "setPurchaseOrder" Тогда
		ПродуктыКЗаказу = Новый ТаблицаЗначений;
		ПродуктыКЗаказу.Колонки.Добавить("ИдентификаторПродукта");
		ПродуктыКЗаказу.Колонки.Добавить("Наименование");
		ПродуктыКЗаказу.Колонки.Добавить("ДатаПоставки");
		ПродуктыКЗаказу.Колонки.Добавить("Количество");
		ПродуктыКЗаказу.Колонки.Добавить("Цена");
		ПродуктыКЗаказу.Колонки.Добавить("КодВалюты");
		ПродуктыКЗаказу.Колонки.Добавить("СтавкаНДС");
		ПродуктыКЗаказу.Колонки.Добавить("КомментарийДляПоставщика");
		ПродуктыКЗаказу.Колонки.Добавить("КомментарийВнутренний");
		
		НоваяСтрока = ПродуктыКЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыВызова);
		
		ПараметрыВызова.Вставить("ПродуктыКЗаказу", ПродуктыКЗаказу);
		
		ОбъектXDTO = Scan_ВебСервисыРазборОтветов.ПолучитьЗаказНаЗакупкуXDTO(Прокси, ПараметрыВызова);
	ИначеЕсли ИмяМетода = "GetListDogovorov" Тогда
		ОбъектXDTO = Scan_ВебСервисыРазборОтветов.ПолучитьКонтрагентаXDTO(Прокси, ПараметрыВызова);
	КонецЕсли;
		
	ТекстЗапроса = Scan_ВебСервисы.СформироватьТекстЗапроса1СДО(ИмяМетода, Прокси, ПараметрыВызова, ОбъектXDTO);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВызватьМетод1СДО(ИмяМетода, ПараметрыВызова)
	
	ОтветСервиса = "";
	
	Отказ             = Ложь;
	СообщениеОбОшибке = "";
	
	Прокси = Scan_ВебСервисы.ПолучитьПрокси1СДО();
	
	Если    ИмяМетода = "setPurchaseOrder" 
		Или ИмяМетода = "SetPurchaseOrder" 
		Тогда
		ПродуктыКЗаказу = Новый ТаблицаЗначений;
		ПродуктыКЗаказу.Колонки.Добавить("ИдентификаторПродукта");
		ПродуктыКЗаказу.Колонки.Добавить("Наименование");
		ПродуктыКЗаказу.Колонки.Добавить("ТипПродукта");
		ПродуктыКЗаказу.Колонки.Добавить("ДатаПоставки");
		ПродуктыКЗаказу.Колонки.Добавить("Количество");
		ПродуктыКЗаказу.Колонки.Добавить("Цена");
		ПродуктыКЗаказу.Колонки.Добавить("КодВалюты");
		ПродуктыКЗаказу.Колонки.Добавить("СтавкаНДС");
		ПродуктыКЗаказу.Колонки.Добавить("КомментарийДляПоставщика");
		ПродуктыКЗаказу.Колонки.Добавить("КомментарийВнутренний");
		
		НоваяСтрока = ПродуктыКЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыВызова);
		
		ПараметрыВызова.Вставить("ПродуктыКЗаказу", ПродуктыКЗаказу);
		
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_setPurchaseOrder(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "setPurchaseOrderApproval" 
		Или   ИмяМетода = "SetPurchaseOrderApproval" 
		Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_setPurchaseOrderApproval(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "GetOrderStatus" Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_GetOrderStatus(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "GetListOfCostCenters" Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_GetListOfCostCenters(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "GetListContragent" Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_GetListContragent(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "GetListDogovorov" Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_GetListDogovorov(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "GetListOfCategories" Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_GetListOfCategories(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	ИначеЕсли ИмяМетода = "GetListOfDeliveries" Тогда
		ОтветСервиса = Scan_ВебСервисыРазборОтветов.ВызватьМетод1СДО_GetListOfDeliveries(Прокси, ПараметрыВызова, Отказ, СообщениеОбОшибке);
	КонецЕсли;
	
	Возврат Scan_ВебСервисы.ПолучитьТекстОтвета1СДО(Прокси, ОтветСервиса);
	
КонецФункции
//rarus agar 15.10.2020 15696 --

//rarus agar 13.03.2021 17373 ++
&НаСервереБезКонтекста
Функция СформироватьТекстЗапросаПортала(ИмяМетода, ПараметрыВызова)
	
	Возврат Scan_ВебСервисы.СформироватьТекстЗапросаПортала(ПараметрыВызова);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВызватьМетодПортала(ИмяМетода, ПараметрыВызова)
	
	Если ИмяМетода = "GetUser" Тогда
		ИмяМетодаWS = "getUser";
		
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетодаПортала(ИмяМетодаWS);
		СтруктураПараметров.Вставить("id", ПараметрыВызова.ИдентификаторПользователя);
	ИначеЕсли ИмяМетода = "AddUpdateUser" Тогда
		ИмяМетодаWS = "addUpdateUser";
		
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетодаПортала(ИмяМетодаWS);
		СтруктураПараметров.Вставить("tokenofms", ПараметрыВызова.Токен);
		СтруктураПараметров.Вставить("id",        ПараметрыВызова.ИдентификаторПользователя);
	ИначеЕсли ИмяМетода = "CheckUserTokenIsOnline" Тогда
		ИмяМетодаWS = "checkUserTokenIsOnline";
		
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетодаПортала(ИмяМетодаWS);
		СтруктураПараметров.Вставить("login", ПараметрыВызова.Логин);
		СтруктураПараметров.Вставить("token", ПараметрыВызова.Токен);
	КонецЕсли;
	
	Отказ = Ложь;
	ИмяСобытияЖурналаРегистрации = "Веб-сервис портала." + ИмяМетодаWS;
	ТекстОтвета = "";
	
	РезультатВызова = Scan_ВебСервисы.ВызовВебСервисаПортала(ИмяМетодаWS,СтруктураПараметров,Отказ,ИмяСобытияЖурналаРегистрации);
	
	Если ТипЗнч(РезультатВызова) = Тип("Структура") Тогда
		ФрагментыТекстаОтвета = Новый Массив;
		
		Для Каждого КлючИЗначение Из РезультатВызова Цикл
			СтрокаПараметра = ""+ КлючИЗначение.Ключ +": "+ КлючИЗначение.Значение;
			ФрагментыТекстаОтвета.Добавить(СтрокаПараметра);
		КонецЦикла;
		
		ТекстОтвета = СтрСоединить(ФрагментыТекстаОтвета, Символы.ПС);
	Иначе
		ТекстОтвета = РезультатВызова;
	КонецЕсли;
	
	Возврат ТекстОтвета;
	
КонецФункции
//rarus agar 13.03.2021 17373 --

&НаСервере
Процедура УстановитьОтборСписка(ДатаНачала, ДатаОкончания, СписокПолучения = Истина, СписокОтправки = Истина)
	
	Если СписокПолучения Тогда		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(НезагруженныеОбъекты,"Период",);
		СозданнаяГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(НезагруженныеОбъекты.Отбор.Элементы, "ТекГруппаИ",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "Период",ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ДатаНачала,,Истина,,);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "Период",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ДатаОкончания,,Истина,,);
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(РегистрацияОбмена1БД,"Период",);
		СозданнаяГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(РегистрацияОбмена1БД.Отбор.Элементы, "ТекГруппаИ",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "Период",ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ДатаНачала,,Истина,,);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "Период",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ДатаОкончания,,Истина,,);
		
	КонецЕсли;
	
	Если СписокОтправки Тогда		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ОтправленныеСобытия,"ДатаИзменения",);
		СозданнаяГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ОтправленныеСобытия.Отбор.Элементы, "ТекГруппаИ",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "ДатаИзменения",ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ДатаНачала,,Истина,,);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "ДатаИзменения",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ДатаОкончания,,Истина,,);
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(НеотправленныеСобытия,"ДатаИзменения",);
		СозданнаяГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(НеотправленныеСобытия.Отбор.Элементы, "ТекГруппаИ",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "ДатаИзменения",ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ДатаНачала,,Истина,,);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "ДатаИзменения",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ДатаОкончания,,Истина,,);
		//rarus bonmak 09.08.2021 16834 ++
		//ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ДанныеДляОтправки,"ДатаИзменения",);
		//СозданнаяГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ДанныеДляОтправки.Отбор.Элементы, "ТекГруппаИ",ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "ДатаИзменения",ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ДатаНачала,,Истина,,);
		//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СозданнаяГруппа, "ДатаИзменения",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ДатаОкончания,,Истина,,);
		//rarus bonmak 09.08.2021 16834 --
	КонецЕсли;
	
КонецПроцедуры

// rarus tenkam 08.04.2019 mantis 14308 +++
&НаСервере
Процедура ЗаполнитьНастройкиПроверкиМетодов()
	НастройкиПроверкиМетодов1БД.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ВидыЗапроса.Ссылка КАК ВидЗапроса,
		|	ЕСТЬNULL(Scan_Обмен1БДНастройкиПроверкиМетодов.Проверять, ЛОЖЬ) КАК Проверять
		|ИЗ
		//rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		|	Справочник.Scan_ВидыЗапроса КАК Scan_ВидыЗапроса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_Обмен1БДНастройкиПроверкиМетодов КАК Scan_Обмен1БДНастройкиПроверкиМетодов
		|		ПО Scan_ВидыЗапроса.Ссылка = Scan_Обмен1БДНастройкиПроверкиМетодов.ВидЗапроса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЗ = НастройкиПроверкиМетодов1БД.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Процедура ОбновитьНастройкуПроверкиВРегистре(ДанныеСтроки)
	
	НаборЗаписей = РегистрыСведений.Scan_Обмен1БДНастройкиПроверкиМетодов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидЗапроса.Установить(ДанныеСтроки.ВидЗапроса);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.ВидЗапроса = ДанныеСтроки.ВидЗапроса;
	НоваяЗапись.Проверять = ДанныеСтроки.Проверять;
	НоваяЗапись.Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// rarus tenkam 08.04.2019 mantis 14308 ---
&НаСервереБезКонтекста
Функция СформироватьТекстCreateSetSOP(КодДоговора, ИмяМетода)
	НайденныйДоговор = Справочники.Scan_ДоговорыВзаиморасчетов.НайтиПоКоду(КодДоговора);
	Если ЗначениеЗаполнено(НайденныйДоговор) Тогда
		Отказ = Ложь;
		СтруктураПараметров = Scan_ВебСервисыРазборОтветов.СОППолучитьСтруктуруДанныхДляОтправкив1БД(НайденныйДоговор, , ИмяМетода);
		СообщениеОбмена = Scan_ВебСервисы.СформироватьСообщениеОбмена(ИмяМетода, СтруктураПараметров, Отказ, "Веб-сервис.CreateSOP");
		Возврат СообщениеОбмена;  			
	КонецЕсли;
	Возврат "";
КонецФункции

#КонецОбласти
